Lzw655/esp-bsp/bsp/esp32_p4_function_ev_board/src/mipi_soc/include/interrupt_core0_reg.h
/*
 * SPDX-FileCopyrightText: 2017-2023 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */
#ifndef _SOC_INTERRUPT_CORE0_REG_H_
#define _SOC_INTERRUPT_CORE0_REG_H_


#ifdef __cplusplus
extern "C" {
#endif

#define INTERRUPT_CORE0_LP_RTC_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x0)
/* INTERRUPT_CORE0_LP_RTC_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_LP_RTC_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_LP_RTC_INT_MAP_M  ((INTERRUPT_CORE0_LP_RTC_INT_MAP_V)<<(INTERRUPT_CORE0_LP_RTC_INT_MAP_S))
#define INTERRUPT_CORE0_LP_RTC_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_LP_RTC_INT_MAP_S  0

#define INTERRUPT_CORE0_LP_WDT_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x4)
/* INTERRUPT_CORE0_LP_WDT_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_LP_WDT_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_LP_WDT_INT_MAP_M  ((INTERRUPT_CORE0_LP_WDT_INT_MAP_V)<<(INTERRUPT_CORE0_LP_WDT_INT_MAP_S))
#define INTERRUPT_CORE0_LP_WDT_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_LP_WDT_INT_MAP_S  0

#define INTERRUPT_CORE0_LP_TIMER_REG_0_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x8)
/* INTERRUPT_CORE0_LP_TIMER_REG_0_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_LP_TIMER_REG_0_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_LP_TIMER_REG_0_INT_MAP_M  ((INTERRUPT_CORE0_LP_TIMER_REG_0_INT_MAP_V)<<(INTERRUPT_CORE0_LP_TIMER_REG_0_INT_MAP_S))
#define INTERRUPT_CORE0_LP_TIMER_REG_0_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_LP_TIMER_REG_0_INT_MAP_S  0

#define INTERRUPT_CORE0_LP_TIMER_REG_1_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0xC)
/* INTERRUPT_CORE0_LP_TIMER_REG_1_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_LP_TIMER_REG_1_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_LP_TIMER_REG_1_INT_MAP_M  ((INTERRUPT_CORE0_LP_TIMER_REG_1_INT_MAP_V)<<(INTERRUPT_CORE0_LP_TIMER_REG_1_INT_MAP_S))
#define INTERRUPT_CORE0_LP_TIMER_REG_1_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_LP_TIMER_REG_1_INT_MAP_S  0

#define INTERRUPT_CORE0_MB_HP_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x10)
/* INTERRUPT_CORE0_MB_HP_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_MB_HP_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_MB_HP_INT_MAP_M  ((INTERRUPT_CORE0_MB_HP_INT_MAP_V)<<(INTERRUPT_CORE0_MB_HP_INT_MAP_S))
#define INTERRUPT_CORE0_MB_HP_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_MB_HP_INT_MAP_S  0

#define INTERRUPT_CORE0_MB_LP_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x14)
/* INTERRUPT_CORE0_MB_LP_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_MB_LP_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_MB_LP_INT_MAP_M  ((INTERRUPT_CORE0_MB_LP_INT_MAP_V)<<(INTERRUPT_CORE0_MB_LP_INT_MAP_S))
#define INTERRUPT_CORE0_MB_LP_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_MB_LP_INT_MAP_S  0

#define INTERRUPT_CORE0_PMU_REG_0_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x18)
/* INTERRUPT_CORE0_PMU_REG_0_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_PMU_REG_0_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_PMU_REG_0_INT_MAP_M  ((INTERRUPT_CORE0_PMU_REG_0_INT_MAP_V)<<(INTERRUPT_CORE0_PMU_REG_0_INT_MAP_S))
#define INTERRUPT_CORE0_PMU_REG_0_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_PMU_REG_0_INT_MAP_S  0

#define INTERRUPT_CORE0_PMU_REG_1_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x1C)
/* INTERRUPT_CORE0_PMU_REG_1_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_PMU_REG_1_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_PMU_REG_1_INT_MAP_M  ((INTERRUPT_CORE0_PMU_REG_1_INT_MAP_V)<<(INTERRUPT_CORE0_PMU_REG_1_INT_MAP_S))
#define INTERRUPT_CORE0_PMU_REG_1_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_PMU_REG_1_INT_MAP_S  0

#define INTERRUPT_CORE0_LP_ANAPERI_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x20)
/* INTERRUPT_CORE0_LP_ANAPERI_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_LP_ANAPERI_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_LP_ANAPERI_INT_MAP_M  ((INTERRUPT_CORE0_LP_ANAPERI_INT_MAP_V)<<(INTERRUPT_CORE0_LP_ANAPERI_INT_MAP_S))
#define INTERRUPT_CORE0_LP_ANAPERI_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_LP_ANAPERI_INT_MAP_S  0

#define INTERRUPT_CORE0_LP_ADC_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x24)
/* INTERRUPT_CORE0_LP_ADC_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_LP_ADC_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_LP_ADC_INT_MAP_M  ((INTERRUPT_CORE0_LP_ADC_INT_MAP_V)<<(INTERRUPT_CORE0_LP_ADC_INT_MAP_S))
#define INTERRUPT_CORE0_LP_ADC_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_LP_ADC_INT_MAP_S  0

#define INTERRUPT_CORE0_LP_GPIO_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x28)
/* INTERRUPT_CORE0_LP_GPIO_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_LP_GPIO_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_LP_GPIO_INT_MAP_M  ((INTERRUPT_CORE0_LP_GPIO_INT_MAP_V)<<(INTERRUPT_CORE0_LP_GPIO_INT_MAP_S))
#define INTERRUPT_CORE0_LP_GPIO_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_LP_GPIO_INT_MAP_S  0

#define INTERRUPT_CORE0_LP_I2C_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x2C)
/* INTERRUPT_CORE0_LP_I2C_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_LP_I2C_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_LP_I2C_INT_MAP_M  ((INTERRUPT_CORE0_LP_I2C_INT_MAP_V)<<(INTERRUPT_CORE0_LP_I2C_INT_MAP_S))
#define INTERRUPT_CORE0_LP_I2C_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_LP_I2C_INT_MAP_S  0

#define INTERRUPT_CORE0_LP_I2S_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x30)
/* INTERRUPT_CORE0_LP_I2S_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_LP_I2S_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_LP_I2S_INT_MAP_M  ((INTERRUPT_CORE0_LP_I2S_INT_MAP_V)<<(INTERRUPT_CORE0_LP_I2S_INT_MAP_S))
#define INTERRUPT_CORE0_LP_I2S_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_LP_I2S_INT_MAP_S  0

