Lzw655/esp-bsp/bsp/esp32_p4_function_ev_board/src/mipi_soc/include/interrupt_core0_reg.h
#define INTERRUPT_CORE0_LP_SPI_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x34)
/* INTERRUPT_CORE0_LP_SPI_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_LP_SPI_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_LP_SPI_INT_MAP_M  ((INTERRUPT_CORE0_LP_SPI_INT_MAP_V)<<(INTERRUPT_CORE0_LP_SPI_INT_MAP_S))
#define INTERRUPT_CORE0_LP_SPI_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_LP_SPI_INT_MAP_S  0

#define INTERRUPT_CORE0_LP_TOUCH_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x38)
/* INTERRUPT_CORE0_LP_TOUCH_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_LP_TOUCH_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_LP_TOUCH_INT_MAP_M  ((INTERRUPT_CORE0_LP_TOUCH_INT_MAP_V)<<(INTERRUPT_CORE0_LP_TOUCH_INT_MAP_S))
#define INTERRUPT_CORE0_LP_TOUCH_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_LP_TOUCH_INT_MAP_S  0

#define INTERRUPT_CORE0_LP_TSENS_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x3C)
/* INTERRUPT_CORE0_LP_TSENS_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_LP_TSENS_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_LP_TSENS_INT_MAP_M  ((INTERRUPT_CORE0_LP_TSENS_INT_MAP_V)<<(INTERRUPT_CORE0_LP_TSENS_INT_MAP_S))
#define INTERRUPT_CORE0_LP_TSENS_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_LP_TSENS_INT_MAP_S  0

#define INTERRUPT_CORE0_LP_UART_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x40)
/* INTERRUPT_CORE0_LP_UART_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_LP_UART_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_LP_UART_INT_MAP_M  ((INTERRUPT_CORE0_LP_UART_INT_MAP_V)<<(INTERRUPT_CORE0_LP_UART_INT_MAP_S))
#define INTERRUPT_CORE0_LP_UART_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_LP_UART_INT_MAP_S  0

#define INTERRUPT_CORE0_LP_EFUSE_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x44)
/* INTERRUPT_CORE0_LP_EFUSE_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_LP_EFUSE_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_LP_EFUSE_INT_MAP_M  ((INTERRUPT_CORE0_LP_EFUSE_INT_MAP_V)<<(INTERRUPT_CORE0_LP_EFUSE_INT_MAP_S))
#define INTERRUPT_CORE0_LP_EFUSE_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_LP_EFUSE_INT_MAP_S  0

#define INTERRUPT_CORE0_LP_SW_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x48)
/* INTERRUPT_CORE0_LP_SW_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_LP_SW_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_LP_SW_INT_MAP_M  ((INTERRUPT_CORE0_LP_SW_INT_MAP_V)<<(INTERRUPT_CORE0_LP_SW_INT_MAP_S))
#define INTERRUPT_CORE0_LP_SW_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_LP_SW_INT_MAP_S  0

#define INTERRUPT_CORE0_LP_SYSREG_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x4C)
/* INTERRUPT_CORE0_LP_SYSREG_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_LP_SYSREG_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_LP_SYSREG_INT_MAP_M  ((INTERRUPT_CORE0_LP_SYSREG_INT_MAP_V)<<(INTERRUPT_CORE0_LP_SYSREG_INT_MAP_S))
#define INTERRUPT_CORE0_LP_SYSREG_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_LP_SYSREG_INT_MAP_S  0

#define INTERRUPT_CORE0_LP_HUK_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x50)
/* INTERRUPT_CORE0_LP_HUK_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_LP_HUK_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_LP_HUK_INT_MAP_M  ((INTERRUPT_CORE0_LP_HUK_INT_MAP_V)<<(INTERRUPT_CORE0_LP_HUK_INT_MAP_S))
#define INTERRUPT_CORE0_LP_HUK_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_LP_HUK_INT_MAP_S  0

#define INTERRUPT_CORE0_SYS_ICM_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x54)
/* INTERRUPT_CORE0_SYS_ICM_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_SYS_ICM_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_SYS_ICM_INT_MAP_M  ((INTERRUPT_CORE0_SYS_ICM_INT_MAP_V)<<(INTERRUPT_CORE0_SYS_ICM_INT_MAP_S))
#define INTERRUPT_CORE0_SYS_ICM_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_SYS_ICM_INT_MAP_S  0

#define INTERRUPT_CORE0_USB_DEVICE_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x58)
/* INTERRUPT_CORE0_USB_DEVICE_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_USB_DEVICE_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_USB_DEVICE_INT_MAP_M  ((INTERRUPT_CORE0_USB_DEVICE_INT_MAP_V)<<(INTERRUPT_CORE0_USB_DEVICE_INT_MAP_S))
#define INTERRUPT_CORE0_USB_DEVICE_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_USB_DEVICE_INT_MAP_S  0

#define INTERRUPT_CORE0_SDIO_HOST_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x5C)
/* INTERRUPT_CORE0_SDIO_HOST_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_SDIO_HOST_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_SDIO_HOST_INT_MAP_M  ((INTERRUPT_CORE0_SDIO_HOST_INT_MAP_V)<<(INTERRUPT_CORE0_SDIO_HOST_INT_MAP_S))
#define INTERRUPT_CORE0_SDIO_HOST_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_SDIO_HOST_INT_MAP_S  0

#define INTERRUPT_CORE0_GDMA_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x60)
/* INTERRUPT_CORE0_GDMA_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_GDMA_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_GDMA_INT_MAP_M  ((INTERRUPT_CORE0_GDMA_INT_MAP_V)<<(INTERRUPT_CORE0_GDMA_INT_MAP_S))
#define INTERRUPT_CORE0_GDMA_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_GDMA_INT_MAP_S  0

#define INTERRUPT_CORE0_SPI2_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x64)
/* INTERRUPT_CORE0_SPI2_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_SPI2_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_SPI2_INT_MAP_M  ((INTERRUPT_CORE0_SPI2_INT_MAP_V)<<(INTERRUPT_CORE0_SPI2_INT_MAP_S))
#define INTERRUPT_CORE0_SPI2_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_SPI2_INT_MAP_S  0

#define INTERRUPT_CORE0_SPI3_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x68)
/* INTERRUPT_CORE0_SPI3_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_SPI3_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_SPI3_INT_MAP_M  ((INTERRUPT_CORE0_SPI3_INT_MAP_V)<<(INTERRUPT_CORE0_SPI3_INT_MAP_S))
#define INTERRUPT_CORE0_SPI3_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_SPI3_INT_MAP_S  0

#define INTERRUPT_CORE0_I2S0_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x6C)
/* INTERRUPT_CORE0_I2S0_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_I2S0_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_I2S0_INT_MAP_M  ((INTERRUPT_CORE0_I2S0_INT_MAP_V)<<(INTERRUPT_CORE0_I2S0_INT_MAP_S))
#define INTERRUPT_CORE0_I2S0_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_I2S0_INT_MAP_S  0

#define INTERRUPT_CORE0_I2S1_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x70)
/* INTERRUPT_CORE0_I2S1_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_I2S1_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_I2S1_INT_MAP_M  ((INTERRUPT_CORE0_I2S1_INT_MAP_V)<<(INTERRUPT_CORE0_I2S1_INT_MAP_S))
#define INTERRUPT_CORE0_I2S1_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_I2S1_INT_MAP_S  0

#define INTERRUPT_CORE0_I2S2_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x74)
/* INTERRUPT_CORE0_I2S2_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_I2S2_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_I2S2_INT_MAP_M  ((INTERRUPT_CORE0_I2S2_INT_MAP_V)<<(INTERRUPT_CORE0_I2S2_INT_MAP_S))
#define INTERRUPT_CORE0_I2S2_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_I2S2_INT_MAP_S  0

