Lzw655/esp-bsp/bsp/esp32_p4_function_ev_board/src/mipi_soc/include/interrupt_core0_reg.h
#define INTERRUPT_CORE0_UHCI0_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x78)
/* INTERRUPT_CORE0_UHCI0_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_UHCI0_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_UHCI0_INT_MAP_M  ((INTERRUPT_CORE0_UHCI0_INT_MAP_V)<<(INTERRUPT_CORE0_UHCI0_INT_MAP_S))
#define INTERRUPT_CORE0_UHCI0_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_UHCI0_INT_MAP_S  0

#define INTERRUPT_CORE0_UART0_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x7C)
/* INTERRUPT_CORE0_UART0_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_UART0_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_UART0_INT_MAP_M  ((INTERRUPT_CORE0_UART0_INT_MAP_V)<<(INTERRUPT_CORE0_UART0_INT_MAP_S))
#define INTERRUPT_CORE0_UART0_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_UART0_INT_MAP_S  0

#define INTERRUPT_CORE0_UART1_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x80)
/* INTERRUPT_CORE0_UART1_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_UART1_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_UART1_INT_MAP_M  ((INTERRUPT_CORE0_UART1_INT_MAP_V)<<(INTERRUPT_CORE0_UART1_INT_MAP_S))
#define INTERRUPT_CORE0_UART1_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_UART1_INT_MAP_S  0

#define INTERRUPT_CORE0_UART2_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x84)
/* INTERRUPT_CORE0_UART2_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_UART2_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_UART2_INT_MAP_M  ((INTERRUPT_CORE0_UART2_INT_MAP_V)<<(INTERRUPT_CORE0_UART2_INT_MAP_S))
#define INTERRUPT_CORE0_UART2_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_UART2_INT_MAP_S  0

#define INTERRUPT_CORE0_UART3_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x88)
/* INTERRUPT_CORE0_UART3_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_UART3_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_UART3_INT_MAP_M  ((INTERRUPT_CORE0_UART3_INT_MAP_V)<<(INTERRUPT_CORE0_UART3_INT_MAP_S))
#define INTERRUPT_CORE0_UART3_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_UART3_INT_MAP_S  0

#define INTERRUPT_CORE0_UART4_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x8C)
/* INTERRUPT_CORE0_UART4_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_UART4_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_UART4_INT_MAP_M  ((INTERRUPT_CORE0_UART4_INT_MAP_V)<<(INTERRUPT_CORE0_UART4_INT_MAP_S))
#define INTERRUPT_CORE0_UART4_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_UART4_INT_MAP_S  0

#define INTERRUPT_CORE0_LCD_CAM_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x90)
/* INTERRUPT_CORE0_LCD_CAM_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_LCD_CAM_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_LCD_CAM_INT_MAP_M  ((INTERRUPT_CORE0_LCD_CAM_INT_MAP_V)<<(INTERRUPT_CORE0_LCD_CAM_INT_MAP_S))
#define INTERRUPT_CORE0_LCD_CAM_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_LCD_CAM_INT_MAP_S  0

#define INTERRUPT_CORE0_ADC_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x94)
/* INTERRUPT_CORE0_ADC_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_ADC_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_ADC_INT_MAP_M  ((INTERRUPT_CORE0_ADC_INT_MAP_V)<<(INTERRUPT_CORE0_ADC_INT_MAP_S))
#define INTERRUPT_CORE0_ADC_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_ADC_INT_MAP_S  0

#define INTERRUPT_CORE0_PWM0_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x98)
/* INTERRUPT_CORE0_PWM0_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_PWM0_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_PWM0_INT_MAP_M  ((INTERRUPT_CORE0_PWM0_INT_MAP_V)<<(INTERRUPT_CORE0_PWM0_INT_MAP_S))
#define INTERRUPT_CORE0_PWM0_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_PWM0_INT_MAP_S  0

#define INTERRUPT_CORE0_PWM1_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x9C)
/* INTERRUPT_CORE0_PWM1_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_PWM1_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_PWM1_INT_MAP_M  ((INTERRUPT_CORE0_PWM1_INT_MAP_V)<<(INTERRUPT_CORE0_PWM1_INT_MAP_S))
#define INTERRUPT_CORE0_PWM1_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_PWM1_INT_MAP_S  0

#define INTERRUPT_CORE0_CAN0_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0xA0)
/* INTERRUPT_CORE0_CAN0_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_CAN0_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_CAN0_INT_MAP_M  ((INTERRUPT_CORE0_CAN0_INT_MAP_V)<<(INTERRUPT_CORE0_CAN0_INT_MAP_S))
#define INTERRUPT_CORE0_CAN0_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_CAN0_INT_MAP_S  0

#define INTERRUPT_CORE0_CAN1_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0xA4)
/* INTERRUPT_CORE0_CAN1_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_CAN1_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_CAN1_INT_MAP_M  ((INTERRUPT_CORE0_CAN1_INT_MAP_V)<<(INTERRUPT_CORE0_CAN1_INT_MAP_S))
#define INTERRUPT_CORE0_CAN1_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_CAN1_INT_MAP_S  0

#define INTERRUPT_CORE0_CAN2_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0xA8)
/* INTERRUPT_CORE0_CAN2_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_CAN2_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_CAN2_INT_MAP_M  ((INTERRUPT_CORE0_CAN2_INT_MAP_V)<<(INTERRUPT_CORE0_CAN2_INT_MAP_S))
#define INTERRUPT_CORE0_CAN2_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_CAN2_INT_MAP_S  0

#define INTERRUPT_CORE0_RMT_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0xAC)
/* INTERRUPT_CORE0_RMT_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_RMT_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_RMT_INT_MAP_M  ((INTERRUPT_CORE0_RMT_INT_MAP_V)<<(INTERRUPT_CORE0_RMT_INT_MAP_S))
#define INTERRUPT_CORE0_RMT_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_RMT_INT_MAP_S  0

#define INTERRUPT_CORE0_I2C0_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0xB0)
/* INTERRUPT_CORE0_I2C0_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_I2C0_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_I2C0_INT_MAP_M  ((INTERRUPT_CORE0_I2C0_INT_MAP_V)<<(INTERRUPT_CORE0_I2C0_INT_MAP_S))
#define INTERRUPT_CORE0_I2C0_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_I2C0_INT_MAP_S  0

#define INTERRUPT_CORE0_I2C1_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0xB4)
/* INTERRUPT_CORE0_I2C1_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_I2C1_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_I2C1_INT_MAP_M  ((INTERRUPT_CORE0_I2C1_INT_MAP_V)<<(INTERRUPT_CORE0_I2C1_INT_MAP_S))
#define INTERRUPT_CORE0_I2C1_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_I2C1_INT_MAP_S  0

#define INTERRUPT_CORE0_TIMERGRP0_T0_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0xB8)
/* INTERRUPT_CORE0_TIMERGRP0_T0_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_TIMERGRP0_T0_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_TIMERGRP0_T0_INT_MAP_M  ((INTERRUPT_CORE0_TIMERGRP0_T0_INT_MAP_V)<<(INTERRUPT_CORE0_TIMERGRP0_T0_INT_MAP_S))
#define INTERRUPT_CORE0_TIMERGRP0_T0_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_TIMERGRP0_T0_INT_MAP_S  0

#define INTERRUPT_CORE0_TIMERGRP0_T1_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0xBC)
/* INTERRUPT_CORE0_TIMERGRP0_T1_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_TIMERGRP0_T1_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_TIMERGRP0_T1_INT_MAP_M  ((INTERRUPT_CORE0_TIMERGRP0_T1_INT_MAP_V)<<(INTERRUPT_CORE0_TIMERGRP0_T1_INT_MAP_S))
#define INTERRUPT_CORE0_TIMERGRP0_T1_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_TIMERGRP0_T1_INT_MAP_S  0

#define INTERRUPT_CORE0_TIMERGRP0_WDT_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0xC0)
/* INTERRUPT_CORE0_TIMERGRP0_WDT_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_TIMERGRP0_WDT_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_TIMERGRP0_WDT_INT_MAP_M  ((INTERRUPT_CORE0_TIMERGRP0_WDT_INT_MAP_V)<<(INTERRUPT_CORE0_TIMERGRP0_WDT_INT_MAP_S))
#define INTERRUPT_CORE0_TIMERGRP0_WDT_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_TIMERGRP0_WDT_INT_MAP_S  0

#define INTERRUPT_CORE0_TIMERGRP1_T0_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0xC4)
/* INTERRUPT_CORE0_TIMERGRP1_T0_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_TIMERGRP1_T0_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_TIMERGRP1_T0_INT_MAP_M  ((INTERRUPT_CORE0_TIMERGRP1_T0_INT_MAP_V)<<(INTERRUPT_CORE0_TIMERGRP1_T0_INT_MAP_S))
#define INTERRUPT_CORE0_TIMERGRP1_T0_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_TIMERGRP1_T0_INT_MAP_S  0

#define INTERRUPT_CORE0_TIMERGRP1_T1_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0xC8)
/* INTERRUPT_CORE0_TIMERGRP1_T1_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_TIMERGRP1_T1_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_TIMERGRP1_T1_INT_MAP_M  ((INTERRUPT_CORE0_TIMERGRP1_T1_INT_MAP_V)<<(INTERRUPT_CORE0_TIMERGRP1_T1_INT_MAP_S))
#define INTERRUPT_CORE0_TIMERGRP1_T1_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_TIMERGRP1_T1_INT_MAP_S  0

