Lzw655/esp-bsp/bsp/esp32_p4_function_ev_board/src/mipi_soc/include/interrupt_core0_reg.h
#define INTERRUPT_CORE0_TIMERGRP1_WDT_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0xCC)
/* INTERRUPT_CORE0_TIMERGRP1_WDT_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_TIMERGRP1_WDT_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_TIMERGRP1_WDT_INT_MAP_M  ((INTERRUPT_CORE0_TIMERGRP1_WDT_INT_MAP_V)<<(INTERRUPT_CORE0_TIMERGRP1_WDT_INT_MAP_S))
#define INTERRUPT_CORE0_TIMERGRP1_WDT_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_TIMERGRP1_WDT_INT_MAP_S  0

#define INTERRUPT_CORE0_LEDC_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0xD0)
/* INTERRUPT_CORE0_LEDC_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_LEDC_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_LEDC_INT_MAP_M  ((INTERRUPT_CORE0_LEDC_INT_MAP_V)<<(INTERRUPT_CORE0_LEDC_INT_MAP_S))
#define INTERRUPT_CORE0_LEDC_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_LEDC_INT_MAP_S  0

#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0xD4)
/* INTERRUPT_CORE0_SYSTIMER_TARGET0_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INT_MAP_M  ((INTERRUPT_CORE0_SYSTIMER_TARGET0_INT_MAP_V)<<(INTERRUPT_CORE0_SYSTIMER_TARGET0_INT_MAP_S))
#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INT_MAP_S  0

#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0xD8)
/* INTERRUPT_CORE0_SYSTIMER_TARGET1_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INT_MAP_M  ((INTERRUPT_CORE0_SYSTIMER_TARGET1_INT_MAP_V)<<(INTERRUPT_CORE0_SYSTIMER_TARGET1_INT_MAP_S))
#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INT_MAP_S  0

#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0xDC)
/* INTERRUPT_CORE0_SYSTIMER_TARGET2_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INT_MAP_M  ((INTERRUPT_CORE0_SYSTIMER_TARGET2_INT_MAP_V)<<(INTERRUPT_CORE0_SYSTIMER_TARGET2_INT_MAP_S))
#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INT_MAP_S  0

#define INTERRUPT_CORE0_AHB_PDMA_IN_CH0_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0xE0)
/* INTERRUPT_CORE0_AHB_PDMA_IN_CH0_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH0_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH0_INT_MAP_M  ((INTERRUPT_CORE0_AHB_PDMA_IN_CH0_INT_MAP_V)<<(INTERRUPT_CORE0_AHB_PDMA_IN_CH0_INT_MAP_S))
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH0_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH0_INT_MAP_S  0

#define INTERRUPT_CORE0_AHB_PDMA_IN_CH1_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0xE4)
/* INTERRUPT_CORE0_AHB_PDMA_IN_CH1_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH1_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH1_INT_MAP_M  ((INTERRUPT_CORE0_AHB_PDMA_IN_CH1_INT_MAP_V)<<(INTERRUPT_CORE0_AHB_PDMA_IN_CH1_INT_MAP_S))
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH1_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH1_INT_MAP_S  0

#define INTERRUPT_CORE0_AHB_PDMA_IN_CH2_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0xE8)
/* INTERRUPT_CORE0_AHB_PDMA_IN_CH2_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH2_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH2_INT_MAP_M  ((INTERRUPT_CORE0_AHB_PDMA_IN_CH2_INT_MAP_V)<<(INTERRUPT_CORE0_AHB_PDMA_IN_CH2_INT_MAP_S))
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH2_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_AHB_PDMA_IN_CH2_INT_MAP_S  0

#define INTERRUPT_CORE0_AHB_PDMA_OUT_CH0_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0xEC)
/* INTERRUPT_CORE0_AHB_PDMA_OUT_CH0_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_AHB_PDMA_OUT_CH0_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_AHB_PDMA_OUT_CH0_INT_MAP_M  ((INTERRUPT_CORE0_AHB_PDMA_OUT_CH0_INT_MAP_V)<<(INTERRUPT_CORE0_AHB_PDMA_OUT_CH0_INT_MAP_S))
#define INTERRUPT_CORE0_AHB_PDMA_OUT_CH0_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_AHB_PDMA_OUT_CH0_INT_MAP_S  0

#define INTERRUPT_CORE0_AHB_PDMA_OUT_CH1_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0xF0)
/* INTERRUPT_CORE0_AHB_PDMA_OUT_CH1_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_AHB_PDMA_OUT_CH1_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_AHB_PDMA_OUT_CH1_INT_MAP_M  ((INTERRUPT_CORE0_AHB_PDMA_OUT_CH1_INT_MAP_V)<<(INTERRUPT_CORE0_AHB_PDMA_OUT_CH1_INT_MAP_S))
#define INTERRUPT_CORE0_AHB_PDMA_OUT_CH1_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_AHB_PDMA_OUT_CH1_INT_MAP_S  0

#define INTERRUPT_CORE0_AHB_PDMA_OUT_CH2_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0xF4)
/* INTERRUPT_CORE0_AHB_PDMA_OUT_CH2_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_AHB_PDMA_OUT_CH2_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_AHB_PDMA_OUT_CH2_INT_MAP_M  ((INTERRUPT_CORE0_AHB_PDMA_OUT_CH2_INT_MAP_V)<<(INTERRUPT_CORE0_AHB_PDMA_OUT_CH2_INT_MAP_S))
#define INTERRUPT_CORE0_AHB_PDMA_OUT_CH2_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_AHB_PDMA_OUT_CH2_INT_MAP_S  0

#define INTERRUPT_CORE0_AXI_PDMA_IN_CH0_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0xF8)
/* INTERRUPT_CORE0_AXI_PDMA_IN_CH0_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_AXI_PDMA_IN_CH0_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_AXI_PDMA_IN_CH0_INT_MAP_M  ((INTERRUPT_CORE0_AXI_PDMA_IN_CH0_INT_MAP_V)<<(INTERRUPT_CORE0_AXI_PDMA_IN_CH0_INT_MAP_S))
#define INTERRUPT_CORE0_AXI_PDMA_IN_CH0_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_AXI_PDMA_IN_CH0_INT_MAP_S  0

#define INTERRUPT_CORE0_AXI_PDMA_IN_CH1_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0xFC)
/* INTERRUPT_CORE0_AXI_PDMA_IN_CH1_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_AXI_PDMA_IN_CH1_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_AXI_PDMA_IN_CH1_INT_MAP_M  ((INTERRUPT_CORE0_AXI_PDMA_IN_CH1_INT_MAP_V)<<(INTERRUPT_CORE0_AXI_PDMA_IN_CH1_INT_MAP_S))
#define INTERRUPT_CORE0_AXI_PDMA_IN_CH1_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_AXI_PDMA_IN_CH1_INT_MAP_S  0

#define INTERRUPT_CORE0_AXI_PDMA_IN_CH2_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x100)
/* INTERRUPT_CORE0_AXI_PDMA_IN_CH2_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_AXI_PDMA_IN_CH2_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_AXI_PDMA_IN_CH2_INT_MAP_M  ((INTERRUPT_CORE0_AXI_PDMA_IN_CH2_INT_MAP_V)<<(INTERRUPT_CORE0_AXI_PDMA_IN_CH2_INT_MAP_S))
#define INTERRUPT_CORE0_AXI_PDMA_IN_CH2_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_AXI_PDMA_IN_CH2_INT_MAP_S  0

#define INTERRUPT_CORE0_AXI_PDMA_OUT_CH0_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x104)
/* INTERRUPT_CORE0_AXI_PDMA_OUT_CH0_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_AXI_PDMA_OUT_CH0_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_AXI_PDMA_OUT_CH0_INT_MAP_M  ((INTERRUPT_CORE0_AXI_PDMA_OUT_CH0_INT_MAP_V)<<(INTERRUPT_CORE0_AXI_PDMA_OUT_CH0_INT_MAP_S))
#define INTERRUPT_CORE0_AXI_PDMA_OUT_CH0_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_AXI_PDMA_OUT_CH0_INT_MAP_S  0

#define INTERRUPT_CORE0_AXI_PDMA_OUT_CH1_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x108)
/* INTERRUPT_CORE0_AXI_PDMA_OUT_CH1_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_AXI_PDMA_OUT_CH1_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_AXI_PDMA_OUT_CH1_INT_MAP_M  ((INTERRUPT_CORE0_AXI_PDMA_OUT_CH1_INT_MAP_V)<<(INTERRUPT_CORE0_AXI_PDMA_OUT_CH1_INT_MAP_S))
#define INTERRUPT_CORE0_AXI_PDMA_OUT_CH1_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_AXI_PDMA_OUT_CH1_INT_MAP_S  0

