Lzw655/esp-bsp/bsp/esp32_p4_function_ev_board/src/mipi_soc/include/interrupt_core0_reg.h
#define INTERRUPT_CORE0_AXI_PDMA_OUT_CH2_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x10C)
/* INTERRUPT_CORE0_AXI_PDMA_OUT_CH2_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_AXI_PDMA_OUT_CH2_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_AXI_PDMA_OUT_CH2_INT_MAP_M  ((INTERRUPT_CORE0_AXI_PDMA_OUT_CH2_INT_MAP_V)<<(INTERRUPT_CORE0_AXI_PDMA_OUT_CH2_INT_MAP_S))
#define INTERRUPT_CORE0_AXI_PDMA_OUT_CH2_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_AXI_PDMA_OUT_CH2_INT_MAP_S  0

#define INTERRUPT_CORE0_RSA_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x110)
/* INTERRUPT_CORE0_RSA_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_RSA_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_RSA_INT_MAP_M  ((INTERRUPT_CORE0_RSA_INT_MAP_V)<<(INTERRUPT_CORE0_RSA_INT_MAP_S))
#define INTERRUPT_CORE0_RSA_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_RSA_INT_MAP_S  0

#define INTERRUPT_CORE0_AES_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x114)
/* INTERRUPT_CORE0_AES_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_AES_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_AES_INT_MAP_M  ((INTERRUPT_CORE0_AES_INT_MAP_V)<<(INTERRUPT_CORE0_AES_INT_MAP_S))
#define INTERRUPT_CORE0_AES_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_AES_INT_MAP_S  0

#define INTERRUPT_CORE0_SHA_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x118)
/* INTERRUPT_CORE0_SHA_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_SHA_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_SHA_INT_MAP_M  ((INTERRUPT_CORE0_SHA_INT_MAP_V)<<(INTERRUPT_CORE0_SHA_INT_MAP_S))
#define INTERRUPT_CORE0_SHA_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_SHA_INT_MAP_S  0

#define INTERRUPT_CORE0_ECC_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x11C)
/* INTERRUPT_CORE0_ECC_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_ECC_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_ECC_INT_MAP_M  ((INTERRUPT_CORE0_ECC_INT_MAP_V)<<(INTERRUPT_CORE0_ECC_INT_MAP_S))
#define INTERRUPT_CORE0_ECC_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_ECC_INT_MAP_S  0

#define INTERRUPT_CORE0_ECDSA_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x120)
/* INTERRUPT_CORE0_ECDSA_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_ECDSA_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_ECDSA_INT_MAP_M  ((INTERRUPT_CORE0_ECDSA_INT_MAP_V)<<(INTERRUPT_CORE0_ECDSA_INT_MAP_S))
#define INTERRUPT_CORE0_ECDSA_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_ECDSA_INT_MAP_S  0

#define INTERRUPT_CORE0_KM_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x124)
/* INTERRUPT_CORE0_KM_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_KM_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_KM_INT_MAP_M  ((INTERRUPT_CORE0_KM_INT_MAP_V)<<(INTERRUPT_CORE0_KM_INT_MAP_S))
#define INTERRUPT_CORE0_KM_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_KM_INT_MAP_S  0

#define INTERRUPT_CORE0_GPIO_INT0_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x128)
/* INTERRUPT_CORE0_GPIO_INT0_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_GPIO_INT0_MAP    0x0000003F
#define INTERRUPT_CORE0_GPIO_INT0_MAP_M  ((INTERRUPT_CORE0_GPIO_INT0_MAP_V)<<(INTERRUPT_CORE0_GPIO_INT0_MAP_S))
#define INTERRUPT_CORE0_GPIO_INT0_MAP_V  0x3F
#define INTERRUPT_CORE0_GPIO_INT0_MAP_S  0

#define INTERRUPT_CORE0_GPIO_INT1_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x12C)
/* INTERRUPT_CORE0_GPIO_INT1_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_GPIO_INT1_MAP    0x0000003F
#define INTERRUPT_CORE0_GPIO_INT1_MAP_M  ((INTERRUPT_CORE0_GPIO_INT1_MAP_V)<<(INTERRUPT_CORE0_GPIO_INT1_MAP_S))
#define INTERRUPT_CORE0_GPIO_INT1_MAP_V  0x3F
#define INTERRUPT_CORE0_GPIO_INT1_MAP_S  0

#define INTERRUPT_CORE0_GPIO_INT2_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x130)
/* INTERRUPT_CORE0_GPIO_INT2_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_GPIO_INT2_MAP    0x0000003F
#define INTERRUPT_CORE0_GPIO_INT2_MAP_M  ((INTERRUPT_CORE0_GPIO_INT2_MAP_V)<<(INTERRUPT_CORE0_GPIO_INT2_MAP_S))
#define INTERRUPT_CORE0_GPIO_INT2_MAP_V  0x3F
#define INTERRUPT_CORE0_GPIO_INT2_MAP_S  0

#define INTERRUPT_CORE0_GPIO_INT3_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x134)
/* INTERRUPT_CORE0_GPIO_INT3_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_GPIO_INT3_MAP    0x0000003F
#define INTERRUPT_CORE0_GPIO_INT3_MAP_M  ((INTERRUPT_CORE0_GPIO_INT3_MAP_V)<<(INTERRUPT_CORE0_GPIO_INT3_MAP_S))
#define INTERRUPT_CORE0_GPIO_INT3_MAP_V  0x3F
#define INTERRUPT_CORE0_GPIO_INT3_MAP_S  0

#define INTERRUPT_CORE0_GPIO_PAD_COMP_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x138)
/* INTERRUPT_CORE0_GPIO_PAD_COMP_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_GPIO_PAD_COMP_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_GPIO_PAD_COMP_INT_MAP_M  ((INTERRUPT_CORE0_GPIO_PAD_COMP_INT_MAP_V)<<(INTERRUPT_CORE0_GPIO_PAD_COMP_INT_MAP_S))
#define INTERRUPT_CORE0_GPIO_PAD_COMP_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_GPIO_PAD_COMP_INT_MAP_S  0

#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_0_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x13C)
/* INTERRUPT_CORE0_CPU_INT_FROM_CPU_0_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_0_MAP    0x0000003F
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_0_MAP_M  ((INTERRUPT_CORE0_CPU_INT_FROM_CPU_0_MAP_V)<<(INTERRUPT_CORE0_CPU_INT_FROM_CPU_0_MAP_S))
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_0_MAP_V  0x3F
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_0_MAP_S  0

#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_1_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x140)
/* INTERRUPT_CORE0_CPU_INT_FROM_CPU_1_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_1_MAP    0x0000003F
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_1_MAP_M  ((INTERRUPT_CORE0_CPU_INT_FROM_CPU_1_MAP_V)<<(INTERRUPT_CORE0_CPU_INT_FROM_CPU_1_MAP_S))
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_1_MAP_V  0x3F
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_1_MAP_S  0

#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_2_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x144)
/* INTERRUPT_CORE0_CPU_INT_FROM_CPU_2_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_2_MAP    0x0000003F
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_2_MAP_M  ((INTERRUPT_CORE0_CPU_INT_FROM_CPU_2_MAP_V)<<(INTERRUPT_CORE0_CPU_INT_FROM_CPU_2_MAP_S))
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_2_MAP_V  0x3F
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_2_MAP_S  0

#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_3_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x148)
/* INTERRUPT_CORE0_CPU_INT_FROM_CPU_3_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_3_MAP    0x0000003F
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_3_MAP_M  ((INTERRUPT_CORE0_CPU_INT_FROM_CPU_3_MAP_V)<<(INTERRUPT_CORE0_CPU_INT_FROM_CPU_3_MAP_S))
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_3_MAP_V  0x3F
#define INTERRUPT_CORE0_CPU_INT_FROM_CPU_3_MAP_S  0

#define INTERRUPT_CORE0_CACHE_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x14C)
/* INTERRUPT_CORE0_CACHE_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_CACHE_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_CACHE_INT_MAP_M  ((INTERRUPT_CORE0_CACHE_INT_MAP_V)<<(INTERRUPT_CORE0_CACHE_INT_MAP_S))
#define INTERRUPT_CORE0_CACHE_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_CACHE_INT_MAP_S  0

#define INTERRUPT_CORE0_FLASH_MSPI_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x150)
/* INTERRUPT_CORE0_FLASH_MSPI_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_FLASH_MSPI_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_FLASH_MSPI_INT_MAP_M  ((INTERRUPT_CORE0_FLASH_MSPI_INT_MAP_V)<<(INTERRUPT_CORE0_FLASH_MSPI_INT_MAP_S))
#define INTERRUPT_CORE0_FLASH_MSPI_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_FLASH_MSPI_INT_MAP_S  0

#define INTERRUPT_CORE0_CSI_BRIDGE_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x154)
/* INTERRUPT_CORE0_CSI_BRIDGE_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_CSI_BRIDGE_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_CSI_BRIDGE_INT_MAP_M  ((INTERRUPT_CORE0_CSI_BRIDGE_INT_MAP_V)<<(INTERRUPT_CORE0_CSI_BRIDGE_INT_MAP_S))
#define INTERRUPT_CORE0_CSI_BRIDGE_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_CSI_BRIDGE_INT_MAP_S  0

