Lzw655/esp-bsp/bsp/esp32_p4_function_ev_board/src/mipi_soc/include/interrupt_core0_reg.h
#define INTERRUPT_CORE0_DSI_BRIDGE_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x158)
/* INTERRUPT_CORE0_DSI_BRIDGE_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_DSI_BRIDGE_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_DSI_BRIDGE_INT_MAP_M  ((INTERRUPT_CORE0_DSI_BRIDGE_INT_MAP_V)<<(INTERRUPT_CORE0_DSI_BRIDGE_INT_MAP_S))
#define INTERRUPT_CORE0_DSI_BRIDGE_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_DSI_BRIDGE_INT_MAP_S  0

#define INTERRUPT_CORE0_CSI_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x15C)
/* INTERRUPT_CORE0_CSI_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_CSI_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_CSI_INT_MAP_M  ((INTERRUPT_CORE0_CSI_INT_MAP_V)<<(INTERRUPT_CORE0_CSI_INT_MAP_S))
#define INTERRUPT_CORE0_CSI_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_CSI_INT_MAP_S  0

#define INTERRUPT_CORE0_DSI_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x160)
/* INTERRUPT_CORE0_DSI_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_DSI_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_DSI_INT_MAP_M  ((INTERRUPT_CORE0_DSI_INT_MAP_V)<<(INTERRUPT_CORE0_DSI_INT_MAP_S))
#define INTERRUPT_CORE0_DSI_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_DSI_INT_MAP_S  0

#define INTERRUPT_CORE0_GMII_PHY_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x164)
/* INTERRUPT_CORE0_GMII_PHY_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_GMII_PHY_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_GMII_PHY_INT_MAP_M  ((INTERRUPT_CORE0_GMII_PHY_INT_MAP_V)<<(INTERRUPT_CORE0_GMII_PHY_INT_MAP_S))
#define INTERRUPT_CORE0_GMII_PHY_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_GMII_PHY_INT_MAP_S  0

#define INTERRUPT_CORE0_LPI_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x168)
/* INTERRUPT_CORE0_LPI_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_LPI_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_LPI_INT_MAP_M  ((INTERRUPT_CORE0_LPI_INT_MAP_V)<<(INTERRUPT_CORE0_LPI_INT_MAP_S))
#define INTERRUPT_CORE0_LPI_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_LPI_INT_MAP_S  0

#define INTERRUPT_CORE0_PMT_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x16C)
/* INTERRUPT_CORE0_PMT_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_PMT_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_PMT_INT_MAP_M  ((INTERRUPT_CORE0_PMT_INT_MAP_V)<<(INTERRUPT_CORE0_PMT_INT_MAP_S))
#define INTERRUPT_CORE0_PMT_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_PMT_INT_MAP_S  0

#define INTERRUPT_CORE0_SBD_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x170)
/* INTERRUPT_CORE0_SBD_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_SBD_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_SBD_INT_MAP_M  ((INTERRUPT_CORE0_SBD_INT_MAP_V)<<(INTERRUPT_CORE0_SBD_INT_MAP_S))
#define INTERRUPT_CORE0_SBD_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_SBD_INT_MAP_S  0

#define INTERRUPT_CORE0_USB_OTG_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x174)
/* INTERRUPT_CORE0_USB_OTG_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_USB_OTG_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_USB_OTG_INT_MAP_M  ((INTERRUPT_CORE0_USB_OTG_INT_MAP_V)<<(INTERRUPT_CORE0_USB_OTG_INT_MAP_S))
#define INTERRUPT_CORE0_USB_OTG_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_USB_OTG_INT_MAP_S  0

#define INTERRUPT_CORE0_USB_OTG_ENDP_MULTI_PROC_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x178)
/* INTERRUPT_CORE0_USB_OTG_ENDP_MULTI_PROC_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_USB_OTG_ENDP_MULTI_PROC_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_USB_OTG_ENDP_MULTI_PROC_INT_MAP_M  ((INTERRUPT_CORE0_USB_OTG_ENDP_MULTI_PROC_INT_MAP_V)<<(INTERRUPT_CORE0_USB_OTG_ENDP_MULTI_PROC_INT_MAP_S))
#define INTERRUPT_CORE0_USB_OTG_ENDP_MULTI_PROC_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_USB_OTG_ENDP_MULTI_PROC_INT_MAP_S  0

#define INTERRUPT_CORE0_JPEG_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x17C)
/* INTERRUPT_CORE0_JPEG_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_JPEG_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_JPEG_INT_MAP_M  ((INTERRUPT_CORE0_JPEG_INT_MAP_V)<<(INTERRUPT_CORE0_JPEG_INT_MAP_S))
#define INTERRUPT_CORE0_JPEG_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_JPEG_INT_MAP_S  0

#define INTERRUPT_CORE0_PPA_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x180)
/* INTERRUPT_CORE0_PPA_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_PPA_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_PPA_INT_MAP_M  ((INTERRUPT_CORE0_PPA_INT_MAP_V)<<(INTERRUPT_CORE0_PPA_INT_MAP_S))
#define INTERRUPT_CORE0_PPA_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_PPA_INT_MAP_S  0

#define INTERRUPT_CORE0_TRACE_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x184)
/* INTERRUPT_CORE0_TRACE_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_TRACE_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_TRACE_INT_MAP_M  ((INTERRUPT_CORE0_TRACE_INT_MAP_V)<<(INTERRUPT_CORE0_TRACE_INT_MAP_S))
#define INTERRUPT_CORE0_TRACE_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_TRACE_INT_MAP_S  0

#define INTERRUPT_CORE0_CORE1_TRACE_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x188)
/* INTERRUPT_CORE0_CORE1_TRACE_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_CORE1_TRACE_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_CORE1_TRACE_INT_MAP_M  ((INTERRUPT_CORE0_CORE1_TRACE_INT_MAP_V)<<(INTERRUPT_CORE0_CORE1_TRACE_INT_MAP_S))
#define INTERRUPT_CORE0_CORE1_TRACE_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_CORE1_TRACE_INT_MAP_S  0

#define INTERRUPT_CORE0_HP_CORE_CTRL_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x18C)
/* INTERRUPT_CORE0_HP_CORE_CTRL_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_HP_CORE_CTRL_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_HP_CORE_CTRL_INT_MAP_M  ((INTERRUPT_CORE0_HP_CORE_CTRL_INT_MAP_V)<<(INTERRUPT_CORE0_HP_CORE_CTRL_INT_MAP_S))
#define INTERRUPT_CORE0_HP_CORE_CTRL_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_HP_CORE_CTRL_INT_MAP_S  0

