Lzw655/esp-bsp/bsp/esp32_p4_function_ev_board/src/mipi_soc/include/interrupt_core0_reg.h
#define INTERRUPT_CORE0_ISP_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x190)
/* INTERRUPT_CORE0_ISP_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_ISP_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_ISP_INT_MAP_M  ((INTERRUPT_CORE0_ISP_INT_MAP_V)<<(INTERRUPT_CORE0_ISP_INT_MAP_S))
#define INTERRUPT_CORE0_ISP_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_ISP_INT_MAP_S  0

#define INTERRUPT_CORE0_I3C_MST_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x194)
/* INTERRUPT_CORE0_I3C_MST_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_I3C_MST_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_I3C_MST_INT_MAP_M  ((INTERRUPT_CORE0_I3C_MST_INT_MAP_V)<<(INTERRUPT_CORE0_I3C_MST_INT_MAP_S))
#define INTERRUPT_CORE0_I3C_MST_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_I3C_MST_INT_MAP_S  0

#define INTERRUPT_CORE0_I3C_SLV_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x198)
/* INTERRUPT_CORE0_I3C_SLV_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_I3C_SLV_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_I3C_SLV_INT_MAP_M  ((INTERRUPT_CORE0_I3C_SLV_INT_MAP_V)<<(INTERRUPT_CORE0_I3C_SLV_INT_MAP_S))
#define INTERRUPT_CORE0_I3C_SLV_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_I3C_SLV_INT_MAP_S  0

#define INTERRUPT_CORE0_USB_OTG11_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x19C)
/* INTERRUPT_CORE0_USB_OTG11_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_USB_OTG11_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_USB_OTG11_INT_MAP_M  ((INTERRUPT_CORE0_USB_OTG11_INT_MAP_V)<<(INTERRUPT_CORE0_USB_OTG11_INT_MAP_S))
#define INTERRUPT_CORE0_USB_OTG11_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_USB_OTG11_INT_MAP_S  0

#define INTERRUPT_CORE0_DMA2D_IN_CH0_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x1A0)
/* INTERRUPT_CORE0_DMA2D_IN_CH0_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_DMA2D_IN_CH0_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_DMA2D_IN_CH0_INT_MAP_M  ((INTERRUPT_CORE0_DMA2D_IN_CH0_INT_MAP_V)<<(INTERRUPT_CORE0_DMA2D_IN_CH0_INT_MAP_S))
#define INTERRUPT_CORE0_DMA2D_IN_CH0_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_DMA2D_IN_CH0_INT_MAP_S  0

#define INTERRUPT_CORE0_DMA2D_IN_CH1_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x1A4)
/* INTERRUPT_CORE0_DMA2D_IN_CH1_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_DMA2D_IN_CH1_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_DMA2D_IN_CH1_INT_MAP_M  ((INTERRUPT_CORE0_DMA2D_IN_CH1_INT_MAP_V)<<(INTERRUPT_CORE0_DMA2D_IN_CH1_INT_MAP_S))
#define INTERRUPT_CORE0_DMA2D_IN_CH1_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_DMA2D_IN_CH1_INT_MAP_S  0

#define INTERRUPT_CORE0_DMA2D_OUT_CH0_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x1A8)
/* INTERRUPT_CORE0_DMA2D_OUT_CH0_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_DMA2D_OUT_CH0_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_DMA2D_OUT_CH0_INT_MAP_M  ((INTERRUPT_CORE0_DMA2D_OUT_CH0_INT_MAP_V)<<(INTERRUPT_CORE0_DMA2D_OUT_CH0_INT_MAP_S))
#define INTERRUPT_CORE0_DMA2D_OUT_CH0_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_DMA2D_OUT_CH0_INT_MAP_S  0

#define INTERRUPT_CORE0_DMA2D_OUT_CH1_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x1AC)
/* INTERRUPT_CORE0_DMA2D_OUT_CH1_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_DMA2D_OUT_CH1_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_DMA2D_OUT_CH1_INT_MAP_M  ((INTERRUPT_CORE0_DMA2D_OUT_CH1_INT_MAP_V)<<(INTERRUPT_CORE0_DMA2D_OUT_CH1_INT_MAP_S))
#define INTERRUPT_CORE0_DMA2D_OUT_CH1_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_DMA2D_OUT_CH1_INT_MAP_S  0

#define INTERRUPT_CORE0_DMA2D_OUT_CH2_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x1B0)
/* INTERRUPT_CORE0_DMA2D_OUT_CH2_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_DMA2D_OUT_CH2_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_DMA2D_OUT_CH2_INT_MAP_M  ((INTERRUPT_CORE0_DMA2D_OUT_CH2_INT_MAP_V)<<(INTERRUPT_CORE0_DMA2D_OUT_CH2_INT_MAP_S))
#define INTERRUPT_CORE0_DMA2D_OUT_CH2_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_DMA2D_OUT_CH2_INT_MAP_S  0

#define INTERRUPT_CORE0_PSRAM_MSPI_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x1B4)
/* INTERRUPT_CORE0_PSRAM_MSPI_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_PSRAM_MSPI_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_PSRAM_MSPI_INT_MAP_M  ((INTERRUPT_CORE0_PSRAM_MSPI_INT_MAP_V)<<(INTERRUPT_CORE0_PSRAM_MSPI_INT_MAP_S))
#define INTERRUPT_CORE0_PSRAM_MSPI_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_PSRAM_MSPI_INT_MAP_S  0

#define INTERRUPT_CORE0_HP_SYSREG_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x1B8)
/* INTERRUPT_CORE0_HP_SYSREG_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_HP_SYSREG_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_HP_SYSREG_INT_MAP_M  ((INTERRUPT_CORE0_HP_SYSREG_INT_MAP_V)<<(INTERRUPT_CORE0_HP_SYSREG_INT_MAP_S))
#define INTERRUPT_CORE0_HP_SYSREG_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_HP_SYSREG_INT_MAP_S  0

#define INTERRUPT_CORE0_PCNT_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x1BC)
/* INTERRUPT_CORE0_PCNT_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_PCNT_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_PCNT_INT_MAP_M  ((INTERRUPT_CORE0_PCNT_INT_MAP_V)<<(INTERRUPT_CORE0_PCNT_INT_MAP_S))
#define INTERRUPT_CORE0_PCNT_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_PCNT_INT_MAP_S  0

#define INTERRUPT_CORE0_HP_PAU_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x1C0)
/* INTERRUPT_CORE0_HP_PAU_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_HP_PAU_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_HP_PAU_INT_MAP_M  ((INTERRUPT_CORE0_HP_PAU_INT_MAP_V)<<(INTERRUPT_CORE0_HP_PAU_INT_MAP_S))
#define INTERRUPT_CORE0_HP_PAU_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_HP_PAU_INT_MAP_S  0

#define INTERRUPT_CORE0_HP_PARLIO_RX_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x1C4)
/* INTERRUPT_CORE0_HP_PARLIO_RX_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_HP_PARLIO_RX_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_HP_PARLIO_RX_INT_MAP_M  ((INTERRUPT_CORE0_HP_PARLIO_RX_INT_MAP_V)<<(INTERRUPT_CORE0_HP_PARLIO_RX_INT_MAP_S))
#define INTERRUPT_CORE0_HP_PARLIO_RX_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_HP_PARLIO_RX_INT_MAP_S  0

