Lzw655/esp-bsp/bsp/esp32_p4_function_ev_board/src/mipi_soc/include/interrupt_core0_reg.h
#define INTERRUPT_CORE0_HP_PARLIO_TX_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x1C8)
/* INTERRUPT_CORE0_HP_PARLIO_TX_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_HP_PARLIO_TX_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_HP_PARLIO_TX_INT_MAP_M  ((INTERRUPT_CORE0_HP_PARLIO_TX_INT_MAP_V)<<(INTERRUPT_CORE0_HP_PARLIO_TX_INT_MAP_S))
#define INTERRUPT_CORE0_HP_PARLIO_TX_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_HP_PARLIO_TX_INT_MAP_S  0

#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH0_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x1CC)
/* INTERRUPT_CORE0_H264_DMA2D_OUT_CH0_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH0_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH0_INT_MAP_M  ((INTERRUPT_CORE0_H264_DMA2D_OUT_CH0_INT_MAP_V)<<(INTERRUPT_CORE0_H264_DMA2D_OUT_CH0_INT_MAP_S))
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH0_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH0_INT_MAP_S  0

#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH1_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x1D0)
/* INTERRUPT_CORE0_H264_DMA2D_OUT_CH1_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH1_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH1_INT_MAP_M  ((INTERRUPT_CORE0_H264_DMA2D_OUT_CH1_INT_MAP_V)<<(INTERRUPT_CORE0_H264_DMA2D_OUT_CH1_INT_MAP_S))
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH1_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH1_INT_MAP_S  0

#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH2_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x1D4)
/* INTERRUPT_CORE0_H264_DMA2D_OUT_CH2_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH2_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH2_INT_MAP_M  ((INTERRUPT_CORE0_H264_DMA2D_OUT_CH2_INT_MAP_V)<<(INTERRUPT_CORE0_H264_DMA2D_OUT_CH2_INT_MAP_S))
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH2_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH2_INT_MAP_S  0

#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH3_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x1D8)
/* INTERRUPT_CORE0_H264_DMA2D_OUT_CH3_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH3_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH3_INT_MAP_M  ((INTERRUPT_CORE0_H264_DMA2D_OUT_CH3_INT_MAP_V)<<(INTERRUPT_CORE0_H264_DMA2D_OUT_CH3_INT_MAP_S))
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH3_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH3_INT_MAP_S  0

#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH4_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x1DC)
/* INTERRUPT_CORE0_H264_DMA2D_OUT_CH4_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH4_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH4_INT_MAP_M  ((INTERRUPT_CORE0_H264_DMA2D_OUT_CH4_INT_MAP_V)<<(INTERRUPT_CORE0_H264_DMA2D_OUT_CH4_INT_MAP_S))
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH4_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_H264_DMA2D_OUT_CH4_INT_MAP_S  0

#define INTERRUPT_CORE0_H264_DMA2D_IN_CH0_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x1E0)
/* INTERRUPT_CORE0_H264_DMA2D_IN_CH0_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH0_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH0_INT_MAP_M  ((INTERRUPT_CORE0_H264_DMA2D_IN_CH0_INT_MAP_V)<<(INTERRUPT_CORE0_H264_DMA2D_IN_CH0_INT_MAP_S))
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH0_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH0_INT_MAP_S  0

#define INTERRUPT_CORE0_H264_DMA2D_IN_CH1_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x1E4)
/* INTERRUPT_CORE0_H264_DMA2D_IN_CH1_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH1_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH1_INT_MAP_M  ((INTERRUPT_CORE0_H264_DMA2D_IN_CH1_INT_MAP_V)<<(INTERRUPT_CORE0_H264_DMA2D_IN_CH1_INT_MAP_S))
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH1_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH1_INT_MAP_S  0

#define INTERRUPT_CORE0_H264_DMA2D_IN_CH2_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x1E8)
/* INTERRUPT_CORE0_H264_DMA2D_IN_CH2_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH2_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH2_INT_MAP_M  ((INTERRUPT_CORE0_H264_DMA2D_IN_CH2_INT_MAP_V)<<(INTERRUPT_CORE0_H264_DMA2D_IN_CH2_INT_MAP_S))
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH2_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH2_INT_MAP_S  0

#define INTERRUPT_CORE0_H264_DMA2D_IN_CH3_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x1EC)
/* INTERRUPT_CORE0_H264_DMA2D_IN_CH3_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH3_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH3_INT_MAP_M  ((INTERRUPT_CORE0_H264_DMA2D_IN_CH3_INT_MAP_V)<<(INTERRUPT_CORE0_H264_DMA2D_IN_CH3_INT_MAP_S))
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH3_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH3_INT_MAP_S  0

#define INTERRUPT_CORE0_H264_DMA2D_IN_CH4_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x1F0)
/* INTERRUPT_CORE0_H264_DMA2D_IN_CH4_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH4_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH4_INT_MAP_M  ((INTERRUPT_CORE0_H264_DMA2D_IN_CH4_INT_MAP_V)<<(INTERRUPT_CORE0_H264_DMA2D_IN_CH4_INT_MAP_S))
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH4_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH4_INT_MAP_S  0

#define INTERRUPT_CORE0_H264_DMA2D_IN_CH5_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x1F4)
/* INTERRUPT_CORE0_H264_DMA2D_IN_CH5_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH5_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH5_INT_MAP_M  ((INTERRUPT_CORE0_H264_DMA2D_IN_CH5_INT_MAP_V)<<(INTERRUPT_CORE0_H264_DMA2D_IN_CH5_INT_MAP_S))
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH5_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_H264_DMA2D_IN_CH5_INT_MAP_S  0

