Lzw655/esp-bsp/bsp/esp32_p4_function_ev_board/src/mipi_soc/include/interrupt_core0_reg.h
#define INTERRUPT_CORE0_H264_REG_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x1F8)
/* INTERRUPT_CORE0_H264_REG_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_H264_REG_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_H264_REG_INT_MAP_M  ((INTERRUPT_CORE0_H264_REG_INT_MAP_V)<<(INTERRUPT_CORE0_H264_REG_INT_MAP_S))
#define INTERRUPT_CORE0_H264_REG_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_H264_REG_INT_MAP_S  0

#define INTERRUPT_CORE0_ASSIST_DEBUG_INT_MAP_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x1FC)
/* INTERRUPT_CORE0_ASSIST_DEBUG_INT_MAP : R/W ;bitpos:[5:0] ;default: 6'b0 ; */
/*description: .*/
#define INTERRUPT_CORE0_ASSIST_DEBUG_INT_MAP    0x0000003F
#define INTERRUPT_CORE0_ASSIST_DEBUG_INT_MAP_M  ((INTERRUPT_CORE0_ASSIST_DEBUG_INT_MAP_V)<<(INTERRUPT_CORE0_ASSIST_DEBUG_INT_MAP_S))
#define INTERRUPT_CORE0_ASSIST_DEBUG_INT_MAP_V  0x3F
#define INTERRUPT_CORE0_ASSIST_DEBUG_INT_MAP_S  0

#define INTERRUPT_CORE0_INTR_STATUS_REG_0_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x200)
/* INTERRUPT_CORE0_INTR_STATUS_0 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: .*/
#define INTERRUPT_CORE0_INTR_STATUS_0    0xFFFFFFFF
#define INTERRUPT_CORE0_INTR_STATUS_0_M  ((INTERRUPT_CORE0_INTR_STATUS_0_V)<<(INTERRUPT_CORE0_INTR_STATUS_0_S))
#define INTERRUPT_CORE0_INTR_STATUS_0_V  0xFFFFFFFF
#define INTERRUPT_CORE0_INTR_STATUS_0_S  0

#define INTERRUPT_CORE0_INTR_STATUS_REG_1_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x204)
/* INTERRUPT_CORE0_INTR_STATUS_1 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: .*/
#define INTERRUPT_CORE0_INTR_STATUS_1    0xFFFFFFFF
#define INTERRUPT_CORE0_INTR_STATUS_1_M  ((INTERRUPT_CORE0_INTR_STATUS_1_V)<<(INTERRUPT_CORE0_INTR_STATUS_1_S))
#define INTERRUPT_CORE0_INTR_STATUS_1_V  0xFFFFFFFF
#define INTERRUPT_CORE0_INTR_STATUS_1_S  0

#define INTERRUPT_CORE0_INTR_STATUS_REG_2_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x208)
/* INTERRUPT_CORE0_INTR_STATUS_2 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: .*/
#define INTERRUPT_CORE0_INTR_STATUS_2    0xFFFFFFFF
#define INTERRUPT_CORE0_INTR_STATUS_2_M  ((INTERRUPT_CORE0_INTR_STATUS_2_V)<<(INTERRUPT_CORE0_INTR_STATUS_2_S))
#define INTERRUPT_CORE0_INTR_STATUS_2_V  0xFFFFFFFF
#define INTERRUPT_CORE0_INTR_STATUS_2_S  0

#define INTERRUPT_CORE0_INTR_STATUS_REG_3_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x20C)
/* INTERRUPT_CORE0_INTR_STATUS_3 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: .*/
#define INTERRUPT_CORE0_INTR_STATUS_3    0xFFFFFFFF
#define INTERRUPT_CORE0_INTR_STATUS_3_M  ((INTERRUPT_CORE0_INTR_STATUS_3_V)<<(INTERRUPT_CORE0_INTR_STATUS_3_S))
#define INTERRUPT_CORE0_INTR_STATUS_3_V  0xFFFFFFFF
#define INTERRUPT_CORE0_INTR_STATUS_3_S  0

#define INTERRUPT_CORE0_CLOCK_GATE_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x210)
/* INTERRUPT_CORE0_REG_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: .*/
#define INTERRUPT_CORE0_REG_CLK_EN    (BIT(0))
#define INTERRUPT_CORE0_REG_CLK_EN_M  (BIT(0))
#define INTERRUPT_CORE0_REG_CLK_EN_V  0x1
#define INTERRUPT_CORE0_REG_CLK_EN_S  0

#define INTERRUPT_CORE0_INTERRUPT_REG_DATE_REG          (DR_REG_INTERRUPT_CORE0_BASE + 0x3FC)
/* INTERRUPT_CORE0_INTERRUPT_REG_DATE : R/W ;bitpos:[27:0] ;default: 28'h2003020 ; */
/*description: .*/
#define INTERRUPT_CORE0_INTERRUPT_REG_DATE    0x0FFFFFFF
#define INTERRUPT_CORE0_INTERRUPT_REG_DATE_M  ((INTERRUPT_CORE0_INTERRUPT_REG_DATE_V)<<(INTERRUPT_CORE0_INTERRUPT_REG_DATE_S))
#define INTERRUPT_CORE0_INTERRUPT_REG_DATE_V  0xFFFFFFF
#define INTERRUPT_CORE0_INTERRUPT_REG_DATE_S  0


#ifdef __cplusplus
}
#endif



#endif /*_SOC_INTERRUPT_CORE0_REG_H_ */
